Revit 2026 API

# WallSweepInfoMaterialId Property

---

The element id of the material used to create the sweep or reveal.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId MaterialId { get; set; }
```
```vb
Public Property MaterialId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ MaterialId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member MaterialId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

This value is not used when creating standalone wall sweeps. The material id of the wall sweep's type is used instead.

#### Reference

WallSweepInfo Class

Autodesk.Revit.DB Namespace